# Утверждается, что шарики для подшипников имеют диаметр 10мм. Используя односторонний критерий α=0,05, 
# проверить эту гипотезу, если в выборке из n=16 шариков, среднее оказалось равным 10,3 мм, а дисперсия нам известна и равна 1

# Формулирование гипотез:
# H0: μ = μ0 нулевая гипотеза
# H1: μ > 0 альтернативная гипотеза, знак > т.к. 10,3 мм > 10 мм
# Выбор критерия
# 𝑍н=(𝑋‾ − μ)/(𝞼/√𝑛)
# α=0.05
# 𝑍т=1.65 табличное значение по генеральной совокупности(находим по таблице Z=0,95, ему соответсвует X=1.65)
# 𝑍н=(𝑋‾ − μ)/(𝞼/√𝑛)=(10.3−10)/(1/√16)=1.2 расчетное значение по выборке

# Сравниваем Zн и Zт
# Расчетное значение 𝑍н попадает в область принятия нулевой гипотезы (Zн < Zт), делаем вывод, что нет статистически значимых различий между средним, полученным по выборке, и средним, полученным по генеральной совокупности
# Вывод: шарики для подшипников имеют диаметр 10 мм . Гипотеза верна при 𝛼=0.05