# Найти среднее арифметическое для выборки: 77, 79, 67, 95, 87, 91, 98, 100, 104, 105. 
# Найти медиану. Найти интерквартильное расстояние.
import numpy as np

x = np.array([77, 79, 67, 95, 87, 91, 98, 100, 104, 105])
average = sum(x) / len(x)
print(average, np.mean(x)) # 90,3 среднее арифметическое
x.sort() # [67  77  79  87  91  95  98 100 104 105]
print(x, len(x)) # 10 элементов, четное число
n = len(x)
a = int(n / 2 - 1)
b = int(n / 2)
med = (x[a] + x[b]) / 2
print(med, np.median(x)) # 93, медиана
k1 = 25
k2 = 75
print(n*k1/100, n*k2/100) # 2.5, 7.5
j1 = int(n*k1/100)
j2 = int(n*k2/100)
print(j1, j2)
# k-я перцентиль совпадает с измерением j+1
print(x[j1], x[j2]) # 79 и 100
print(x[j2] - x[j1]) # интерквартильное расстояние
