# Найти ско СВ Х, распределенной по биномиальному закону с параметрами n=50, p=0.6
import math

Sigma = math.sqrt(50 * 0.6 * (1 - 0.6))
print(Sigma)