# Дана та же генеральная совокупность из задачи №3 со средним арифметическим 50 и
# дисперсией 9. В скольких стандартных отклонениях лежит вес 56 г?
print((56-50) / 3) # В 2 сигмах (стандартных отклонениях)