# Найдите математическое ожидание случайной величины X, равномерно распределенной на отрезке (-3, 3]
# 𝑀(𝑥)=(𝑎+𝑏)/2
# 𝐷=〖(𝑏−𝑎)〗^2/12
M = (- 3 + 3) / 2
print(M)