# Найдите среднее квадратичное отклонение случайной величины X, равномерно распределенной на отрезке [-2, 7]
сигма = (((7 - (-2))**2) / 12)**0.5
print(сигма)