# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал для разности среднего роста родителей и детей.
import numpy as np
from scipy import stats

d = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
m = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
n_1 = len(d) # 10
n_2 = len(m) # 10
X_1 = np.mean(d) # 166.2
X_2 = np.mean(m) # 168.1
Δ = X_1 - X_2 # -1.9
D_1 = np.var(d, ddof=1) # 91.067
D_2 = np.var(m, ddof=1) # 60.100
D = (D_1 + D_2) / 2 # 75.583
SE = np.sqrt(D/n_1 + D/n_2) # 3.888
#t = 2.101 # по таблице для альфа 0.975 и степени свободы 2*(10-1)=18
t = stats.t.ppf(0.975, 18) # 2.101
# print(n_1, n_2, X_1, X_2, Δ, D_1, D_2, D, SE, t)
print(f'[{round(Δ - t * SE, 2)}; {round(Δ + t * SE, 2)}]') # [-10.07; 6.27]