#  σ = √(𝑝(1−𝑝))
# 𝑆𝐸= √((𝑝(1−𝑝))/𝑛)
# Этим приближением мы пользуемся, когда 𝑛∗𝑝 ̂  и 𝑛∗(1−𝑝 ̂) больше 5. Это утверждение нарушается при маленьких объемах выборки и 𝑝  близких к 0 или 1.
# В сфере образования страны X работают 20% женщин и 80% мужчин. Рассчитать стандартное отклонение для доли  p = 0.2
# σ = √(0.2 (1−0.2)) = 0.4
# А что будет, если   p = 0.5?
# σ = √(0.5 (1−0.5)) = 0.5, 
# для p = 0 (в коллективе вообще нет  женщин, одни мужчины)
# σ = √(0 (1−0)) = 0
# для  p = 1 (коллективе все женщины и совсем нет мужчин)
# σ = √(1 (1−1)) = 0