# Дана выборка, состоящая из роста 10 человек. Оценить средний рост в данной популяции с помощью 95% интервала.
# [178, 184, 149, 193, 186, 173, 169, 175, 159, 174]
# Х ± 𝑡_(𝛼/2) ∗ 𝜎/√𝑛
import numpy as np
from scipy import stats

a = np.array([178, 184, 149, 193, 186, 173, 169, 175, 159, 174])
n = 10
X = np.mean(a) # 174.0
𝜎 = np.std(a, ddof=1) # 12.90
D = np.var(a, ddof=1) # 166.44
#t = 2.262 # по таблице для альфа 0.975 и степень свободы 10-1=9 ИЛИ
t = stats.t.ppf(0.975, 9) # 2.262
print(f'[{round(X - t * 𝜎 / (n)**0.5, 2)}; {round(X + t * 𝜎 / (n)**0.5, 2)}]') # [164.77; 183.23]
print(f'[{round(X - t * np.sqrt(D/10), 2)}; {round(X + t * np.sqrt(D/10), 2)}]') # [164.77; 183.23]
print(X, t, 𝜎, D)
