# Оценить различие в росте между двумя средними арифметическими популяции 
# a  и b с помощью 95% доверительного интервала.
# a [178, 184, 149, 193, 186, 173, 169, 175, 159, 174]
# b [150, 154, 167, 165, 171, 150, 158, 170, 175, 160]

# Δ ± 𝑡_(𝛼/2)∗ 𝑆_Δ , где Δ = (𝑋_1) - (𝑋_2) 
# 𝐷 = 1/2(𝐷_1 + 𝐷_2), где 𝐷_1 и 𝐷_2 – дисперсии обеих групп
# 𝑆_Δ = √(𝐷/𝑛_1 +𝐷/𝑛_2 ), где 𝑛_1 и  𝑛_2 – объемы выборок.
# 𝑑𝑓 = 2∗(𝑛−1), где n - объем выборки
import numpy as np
from scipy import stats

a = np.array([178, 184, 149, 193, 186, 173, 169, 175, 159, 174])
b = np.array([150, 154, 167, 165, 171, 150, 158, 170, 175, 160])
n_1 = len(a) # 10
n_2 = len(b) # 10
X_1 = np.mean(a) # 174.0
X_2 = np.mean(b) # 162.0
Δ = X_1 - X_2 # 12
D_1 = np.var(a, ddof=1) # 166.44
D_2 = np.var(b, ddof=1) # 80.0
D = (𝐷_1 + 𝐷_2) / 2 # 123.22
SE = np.sqrt(D/n_1 + D/n_2) # 4.964
#t = 2.101 # по таблице для альфа 0.975 и степень свободы 2*(10-1)=18
t = stats.t.ppf(0.975, 18) # 2.101
print(f'[{round(Δ - t * SE, 2)}; {round(Δ + t * SE, 2)}]') # [1.57; 22.43]